<a href="https://colab.research.google.com/github/MagdaSousa/Estudo_Pandas/blob/master/melt.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
?pd.melt()
# fundir, conbinar coisas

In [3]:
df =pd.DataFrame({"A":{0:'a',1:'b',2:'c'},
                  "B":{0:1,1:3,2:5},
                  "C":{0:2,1:4,2:6}
                  })

In [4]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [5]:
# fazendo a fusão, combinação do dataframe
pd.melt(df,id_vars=['A'],value_vars=['B'])
# Coluna A, ficará como id de referência, vou fundir  a coluna A com a B. Então os itens 
# da coluna A vão ser referenciados aos da coluna B, excluindo a coluna C

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [6]:
pd.melt(df,id_vars=['A'],value_vars=['B','C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [7]:
#Alterando nome das variáveis default( variable e value)
pd.melt(df,id_vars=['A'],value_vars=['B','C'],var_name="VARTESTES",value_name="numeros")

   A VARTESTES  numeros
0  a         B        1
1  b         B        3
2  c         B        5
3  a         C        2
4  b         C        4
5  c         C        6

Outros exemplos de utilização

In [8]:
data ={
    "LOCALIZAÇÃO":['cidadeA','cidadeB'],
    "TEMPERATURA":['Prevista','Atual'],
    "SET-2019":[30,32],
    "OUT-2019":[45,43],
    "NOV-2019":[24,22]}

print(data)

{'LOCALIZAÇÃO': ['cidadeA', 'cidadeB'], 'TEMPERATURA': ['Prevista', 'Atual'], 'SET-2019': [30, 32], 'OUT-2019': [45, 43], 'NOV-2019': [24, 22]}

In [10]:
df =pd.DataFrame(data,columns=["LOCALIZAÇÃO","TEMPERATURA","SET-2019","OUT-2019","NOV-2019"])
print(df)

  LOCALIZAÇÃO TEMPERATURA  SET-2019  OUT-2019  NOV-2019
0     cidadeA    Prevista        30        45        24
1     cidadeB       Atual        32        43        22

In [11]:
df2 = pd.melt(df,id_vars=["LOCALIZAÇÃO","TEMPERATURA"],var_name='DATE',value_name='VALUE')

# Objetivo é obter uma série temporal

  LOCALIZAÇÃO TEMPERATURA      DATE  VALUE
0     cidadeA    Prevista  SET-2019     30
1     cidadeB       Atual  SET-2019     32
2     cidadeA    Prevista  OUT-2019     45
3     cidadeB       Atual  OUT-2019     43
4     cidadeA    Prevista  NOV-2019     24
5     cidadeB       Atual  NOV-2019     22

In [12]:
df2 = pd.melt(df,id_vars=["LOCALIZAÇÃO"],var_name='DATE',value_name='VALUE')
print(df2)
#essa organização não é interessante

  LOCALIZAÇÃO         DATE     VALUE
0     cidadeA  TEMPERATURA  Prevista
1     cidadeB  TEMPERATURA     Atual
2     cidadeA     SET-2019        30
3     cidadeB     SET-2019        32
4     cidadeA     OUT-2019        45
5     cidadeB     OUT-2019        43
6     cidadeA     NOV-2019        24
7     cidadeB     NOV-2019        22